apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_pwr.h
/****************************************************************************
 * arch/arm/src/stm32u3/hardware/stm32u3xx_pwr.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32U3_HARDWARE_STM32U3XX_PWR_H
#define __ARCH_ARM_SRC_STM32U3_HARDWARE_STM32U3XX_PWR_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define STM32_PWR_CR1_OFFSET      0x0000
#define STM32_PWR_CR2_OFFSET      0x0004
#define STM32_PWR_CR3_OFFSET      0x0008
#define STM32_PWR_VOSR_OFFSET     0x000c
#define STM32_PWR_SVMCR_OFFSET    0x0010
#define STM32_PWR_WUCR1_OFFSET    0x0014
#define STM32_PWR_WUCR2_OFFSET    0x0018
#define STM32_PWR_WUCR3_OFFSET    0x001c
#define STM32_PWR_BDCR_OFFSET     0x0024
#define STM32_PWR_DBPR_OFFSET     0x0028
#define STM32_PWR_SECCFGR_OFFSET  0x0030
#define STM32_PWR_PRIVCFGR_OFFSET 0x0034
#define STM32_PWR_SR_OFFSET       0x0038
#define STM32_PWR_SVMSR_OFFSET    0x003c
#define STM32_PWR_WUSR_OFFSET     0x0044
#define STM32_PWR_WUSCR_OFFSET    0x0048
#define STM32_PWR_APCR_OFFSET     0x004c
#define STM32_PWR_PUCRA_OFFSET    0x0050
#define STM32_PWR_PDCRA_OFFSET    0x0054
#define STM32_PWR_PUCRB_OFFSET    0x0058
#define STM32_PWR_PDCRB_OFFSET    0x005c
#define STM32_PWR_PUCRC_OFFSET    0x0060
#define STM32_PWR_PDCRC_OFFSET    0x0064
#define STM32_PWR_PUCRD_OFFSET    0x0068
#define STM32_PWR_PDCRD_OFFSET    0x006c
#define STM32_PWR_PUCRE_OFFSET    0x0070
#define STM32_PWR_PDCRE_OFFSET    0x0074
#define STM32_PWR_PUCRF_OFFSET    0x0078
#define STM32_PWR_PDCRF_OFFSET    0x007c
#define STM32_PWR_PUCRG_OFFSET    0x0080
#define STM32_PWR_PDCRG_OFFSET    0x0084
#define STM32_PWR_PUCRH_OFFSET    0x0088
#define STM32_PWR_PDCRH_OFFSET    0x008c
#define STM32_PWR_I3CPUCR1_OFFSET 0x00b0
#define STM32_PWR_I3CPUCR2_OFFSET 0x00b4

/* Register Addresses *******************************************************/

#define STM32_PWR_CR1      (STM32_PWR_BASE + STM32_PWR_CR1_OFFSET)
#define STM32_PWR_CR2      (STM32_PWR_BASE + STM32_PWR_CR2_OFFSET)
#define STM32_PWR_CR3      (STM32_PWR_BASE + STM32_PWR_CR3_OFFSET)
#define STM32_PWR_VOSR     (STM32_PWR_BASE + STM32_PWR_VOSR_OFFSET)
#define STM32_PWR_SVMCR    (STM32_PWR_BASE + STM32_PWR_SVMCR_OFFSET)
#define STM32_PWR_WUCR1    (STM32_PWR_BASE + STM32_PWR_WUCR1_OFFSET)
#define STM32_PWR_WUCR2    (STM32_PWR_BASE + STM32_PWR_WUCR2_OFFSET)
#define STM32_PWR_WUCR3    (STM32_PWR_BASE + STM32_PWR_WUCR3_OFFSET)
#define STM32_PWR_BDCR     (STM32_PWR_BASE + STM32_PWR_BDCR_OFFSET)
#define STM32_PWR_DBPR     (STM32_PWR_BASE + STM32_PWR_DBPR_OFFSET)
#define STM32_PWR_SECCFGR  (STM32_PWR_BASE + STM32_PWR_SECCFGR_OFFSET)
#define STM32_PWR_PRIVCFGR (STM32_PWR_BASE + STM32_PWR_PRIVCFGR_OFFSET)
#define STM32_PWR_SR       (STM32_PWR_BASE + STM32_PWR_SR_OFFSET)
#define STM32_PWR_SVMSR    (STM32_PWR_BASE + STM32_PWR_SVMSR_OFFSET)
#define STM32_PWR_WUSR     (STM32_PWR_BASE + STM32_PWR_WUSR_OFFSET)
#define STM32_PWR_WUSCR    (STM32_PWR_BASE + STM32_PWR_WUSCR_OFFSET)
#define STM32_PWR_APCR     (STM32_PWR_BASE + STM32_PWR_APCR_OFFSET)
#define STM32_PWR_PUCRA    (STM32_PWR_BASE + STM32_PWR_PUCRA_OFFSET)
#define STM32_PWR_PDCRA    (STM32_PWR_BASE + STM32_PWR_PDCRA_OFFSET)
#define STM32_PWR_PUCRB    (STM32_PWR_BASE + STM32_PWR_PUCRB_OFFSET)
#define STM32_PWR_PDCRB    (STM32_PWR_BASE + STM32_PWR_PDCRB_OFFSET)
#define STM32_PWR_PUCRC    (STM32_PWR_BASE + STM32_PWR_PUCRC_OFFSET)
#define STM32_PWR_PDCRC    (STM32_PWR_BASE + STM32_PWR_PDCRC_OFFSET)
#define STM32_PWR_PUCRD    (STM32_PWR_BASE + STM32_PWR_PUCRD_OFFSET)
#define STM32_PWR_PDCRD    (STM32_PWR_BASE + STM32_PWR_PDCRD_OFFSET)
#define STM32_PWR_PUCRE    (STM32_PWR_BASE + STM32_PWR_PUCRE_OFFSET)
#define STM32_PWR_PDCRE    (STM32_PWR_BASE + STM32_PWR_PDCRE_OFFSET)
#define STM32_PWR_PUCRF    (STM32_PWR_BASE + STM32_PWR_PUCRF_OFFSET)
#define STM32_PWR_PDCRF    (STM32_PWR_BASE + STM32_PWR_PDCRF_OFFSET)
#define STM32_PWR_PUCRG    (STM32_PWR_BASE + STM32_PWR_PUCRG_OFFSET)
#define STM32_PWR_PDCRG    (STM32_PWR_BASE + STM32_PWR_PDCRG_OFFSET)
#define STM32_PWR_PUCRH    (STM32_PWR_BASE + STM32_PWR_PUCRH_OFFSET)
#define STM32_PWR_PDCRH    (STM32_PWR_BASE + STM32_PWR_PDCRH_OFFSET)
#define STM32_PWR_I3CPUCR1 (STM32_PWR_BASE + STM32_PWR_I3CPUCR1_OFFSET)
#define STM32_PWR_I3CPUCR2 (STM32_PWR_BASE + STM32_PWR_I3CPUCR2_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* PWR control register 1 */

#define PWR_CR1_LPMS_SHIFT      (0)
#define PWR_CR1_LPMS_MASK       (0x7 << PWR_CR1_LPMS_SHIFT)
#define PWR_CR1_LPMS(n)         ((n) << PWR_CR1_LPMS_SHIFT)
#  define PWR_CR1_LPMS_STOP0    PWR_CR1_LPMS(0)
#  define PWR_CR1_LPMS_STOP1    PWR_CR1_LPMS(1)
#  define PWR_CR1_LPMS_STOP2    PWR_CR1_LPMS(2)
#  define PWR_CR1_LPMS_STOP3    PWR_CR1_LPMS(3)
#  define PWR_CR1_LPMS_STANDBY  PWR_CR1_LPMS(4)
#  define PWR_CR1_LPMS_SHUTDOWN PWR_CR1_LPMS(6)
#define PWR_CR1_RRSB1           (1 << 4)
#define PWR_CR1_RRSB2           (1 << 5)
#define PWR_CR1_RRSB3           (1 << 6)
#define PWR_CR1_ULPMEN          (1 << 7)
#define PWR_CR1_SRAM1PD         (1 << 8)
#define PWR_CR1_SRAM2PD         (1 << 9)
#define PWR_CR1_SRAM3PD         (1 << 10)
#define PWR_CR1_SRAM4PD         (1 << 11)

