apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_pwr.h
/* PWR control register 2 */

#define PWR_CR2_RESET           0x00000000
#define PWR_CR2_SRAM1PDS1       (1 << 0)
#define PWR_CR2_SRAM1PDS2       (1 << 1)
#define PWR_CR2_SRAM1PDS3       (1 << 2)
#define PWR_CR2_SRAM1PDS4       (1 << 3)
#define PWR_CR2_SRAM1PDS5       (1 << 4)
#define PWR_CR2_SRAM1PDS6       (1 << 5)
#define PWR_CR2_SRAM1PDS7       (1 << 6)
#define PWR_CR2_SRAM3PDS1       (1 << 8)
#define PWR_CR2_SRAM3PDS2       (1 << 9)
#define PWR_CR2_SRAM3PDS3       (1 << 10)
#define PWR_CR2_SRAM3PDS4       (1 << 11)
#define PWR_CR2_SRAM3PDS5       (1 << 12)
#define PWR_CR2_SRAM2PDS1       (1 << 16)
#define PWR_CR2_SRAM2PDS2       (1 << 17)
#define PWR_CR2_SRAM2PDS3       (1 << 18)
#define PWR_CR2_SRAM4PDS        (1 << 20)
#define PWR_CR2_ICRAMPDS        (1 << 25)
#define PWR_CR2_PRAMPDS         (1 << 26)
#define PWR_CR2_PKARAMPDS       (1 << 27)
#define PWR_CR2_SRAMFWU         (1 << 28)
#define PWR_CR2_FLASHFWU        (1 << 29)

/* PWR control register 3 */

#define PWR_CR3_RESET           0x00000000
#define PWR_CR3_REGSEL          (1 << 1)
#  define PWR_CR3_REGSEL_LDO    (0)
#  define PWR_CR3_REGSEL_SMPS   PWR_CR3_REGSEL
#define PWR_CR3_FSTEN           (1 << 2)

/* PWR voltage scaling register */

#define PWR_VOSR_RESET          0x00020002
#define PWR_VOSR_R1EN           (1 << 0)
#define PWR_VOSR_R2EN           (1 << 1)
#define PWR_VOSR_BOOSTEN        (1 << 8)
#define PWR_VOSR_R1RDY          (1 << 16)
#define PWR_VOSR_R2RDY          (1 << 17)
#define PWR_VOSR_BOOSTRDY       (1 << 24)

/* PWR supply voltage monitoring control register */

#define PWR_SVMCR_RESET         0x00000000
#define PWR_SVMCR_PVDE          (1 << 4)
#define PWR_SVMCR_PVDLS_SHIFT   (5)
#define PWR_SVMCR_PVDLS_MASK    (0x7 << PWR_SVMCR_PVDLS_SHIFT)
#define PWR_SVMCR_PVDLS(n)      ((n) << PWR_SVMCR_PVDLS_SHIFT)
#  define PWR_SVMCR_PVDLS_2000mv PWR_SVMCR_PVDLS(0)
#  define PWR_SVMCR_PVDLS_2200mv PWR_SVMCR_PVDLS(1)
#  define PWR_SVMCR_PVDLS_2400mv PWR_SVMCR_PVDLS(2)
#  define PWR_SVMCR_PVDLS_2500mv PWR_SVMCR_PVDLS(3)
#  define PWR_SVMCR_PVDLS_2600mv PWR_SVMCR_PVDLS(4)
#  define PWR_SVMCR_PVDLS_2800mv PWR_SVMCR_PVDLS(5)
#  define PWR_SVMCR_PVDLS_2900mv PWR_SVMCR_PVDLS(6)
#  define PWR_SVMCR_PVDLS_EXT   PWR_SVMCR_PVDLS(7)
#define PWR_SVMCR_UVMEN         (1 << 24)
#define PWR_SVMCR_IO2VMEN       (1 << 25)
#define PWR_SVMCR_AVM1EN        (1 << 26)
#define PWR_SVMCR_AVM2EN        (1 << 27)
#define PWR_SVMCR_USV           (1 << 28)
#define PWR_SVMCR_IO2SV         (1 << 29)
#define PWR_SVMCR_ASV           (1 << 30)

/* PWR wake-up control register 1 */

#define PWR_WUCR1_RESET         0x00000000
#define PWR_WUCR1_WUPEN1        (1 << 0)
#define PWR_WUCR1_WUPEN2        (1 << 1)
#define PWR_WUCR1_WUPEN3        (1 << 2)
#define PWR_WUCR1_WUPEN4        (1 << 3)
#define PWR_WUCR1_WUPEN5        (1 << 4)
#define PWR_WUCR1_WUPEN6        (1 << 5)
#define PWR_WUCR1_WUPEN7        (1 << 6)
#define PWR_WUCR1_WUPEN8        (1 << 7)
#define PWR_WUCR1_WUPEN9        (1 << 8)
#define PWR_WUCR1_WUPEN10       (1 << 9)

/* PWR wake-up control register 2 */

#define PWR_WUCR2_RESET         0x00000000
#define PWR_WUCR2_WUPP1         (1 << 0)
#define PWR_WUCR2_WUPP2         (1 << 1)
#define PWR_WUCR2_WUPP3         (1 << 2)
#define PWR_WUCR2_WUPP4         (1 << 3)
#define PWR_WUCR2_WUPP5         (1 << 4)
#define PWR_WUCR2_WUPP6         (1 << 5)
#define PWR_WUCR2_WUPP7         (1 << 6)
#define PWR_WUCR2_WUPP8         (1 << 7)

/* PWR wake-up control register 3 */

#define PWR_WUCR3_RESET         0x00000000
#define PWR_WUCR3_WUSEL1_SHIFT  (0)
#define PWR_WUCR3_WUSEL1_MASK   (0x3 << PWR_WUCR3_WUSEL1_SHIFT)
#define PWR_WUCR3_WUSEL1(n)     ((n) << PWR_WUCR3_WUSEL1_SHIFT)
#  define PWR_WUCR3_WUSEL1_0    PWR_WUCR3_WUSEL1(0)
#  define PWR_WUCR3_WUSEL1_1    PWR_WUCR3_WUSEL1(1)
#  define PWR_WUCR3_WUSEL1_2    PWR_WUCR3_WUSEL1(2)
#  define PWR_WUCR3_WUSEL1_3    PWR_WUCR3_WUSEL1(3)
#define PWR_WUCR3_WUSEL2_SHIFT  (2)
#define PWR_WUCR3_WUSEL2_MASK   (0x3 << PWR_WUCR3_WUSEL2_SHIFT)
#define PWR_WUCR3_WUSEL2(n)     ((n) << PWR_WUCR3_WUSEL2_SHIFT)
#  define PWR_WUCR3_WUSEL2_0    PWR_WUCR3_WUSEL2(0)
#  define PWR_WUCR3_WUSEL2_1    PWR_WUCR3_WUSEL2(1)
#  define PWR_WUCR3_WUSEL2_2    PWR_WUCR3_WUSEL2(2)
#  define PWR_WUCR3_WUSEL2_3    PWR_WUCR3_WUSEL2(3)
#define PWR_WUCR3_WUSEL3_SHIFT  (4)
#define PWR_WUCR3_WUSEL3_MASK   (0x3 << PWR_WUCR3_WUSEL3_SHIFT)
#define PWR_WUCR3_WUSEL3(n)     ((n) << PWR_WUCR3_WUSEL3_SHIFT)
#  define PWR_WUCR3_WUSEL3_0    PWR_WUCR3_WUSEL3(0)
#  define PWR_WUCR3_WUSEL3_1    PWR_WUCR3_WUSEL3(1)
#  define PWR_WUCR3_WUSEL3_2    PWR_WUCR3_WUSEL3(2)
#  define PWR_WUCR3_WUSEL3_3    PWR_WUCR3_WUSEL3(3)
#define PWR_WUCR3_WUSEL4_SHIFT  (6)
#define PWR_WUCR3_WUSEL4_MASK   (0x3 << PWR_WUCR3_WUSEL4_SHIFT)
#define PWR_WUCR3_WUSEL4(n)     ((n) << PWR_WUCR3_WUSEL4_SHIFT)
#  define PWR_WUCR3_WUSEL4_0    PWR_WUCR3_WUSEL4(0)
#  define PWR_WUCR3_WUSEL4_1    PWR_WUCR3_WUSEL4(1)
#  define PWR_WUCR3_WUSEL4_2    PWR_WUCR3_WUSEL4(2)
#  define PWR_WUCR3_WUSEL4_3    PWR_WUCR3_WUSEL4(3)
#define PWR_WUCR3_WUSEL5_SHIFT  (8)
#define PWR_WUCR3_WUSEL5_MASK   (0x3 << PWR_WUCR3_WUSEL5_SHIFT)
#define PWR_WUCR3_WUSEL5(n)     ((n) << PWR_WUCR3_WUSEL5_SHIFT)
#  define PWR_WUCR3_WUSEL5_0    PWR_WUCR3_WUSEL5(0)
#  define PWR_WUCR3_WUSEL5_1    PWR_WUCR3_WUSEL5(1)
#  define PWR_WUCR3_WUSEL5_2    PWR_WUCR3_WUSEL5(2)
#  define PWR_WUCR3_WUSEL5_3    PWR_WUCR3_WUSEL5(3)
#define PWR_WUCR3_WUSEL6_SHIFT  (10)
#define PWR_WUCR3_WUSEL6_MASK   (0x3 << PWR_WUCR3_WUSEL6_SHIFT)
#define PWR_WUCR3_WUSEL6(n)     ((n) << PWR_WUCR3_WUSEL6_SHIFT)
#  define PWR_WUCR3_WUSEL6_0    PWR_WUCR3_WUSEL6(0)
#  define PWR_WUCR3_WUSEL6_1    PWR_WUCR3_WUSEL6(1)
#  define PWR_WUCR3_WUSEL6_2    PWR_WUCR3_WUSEL6(2)
#  define PWR_WUCR3_WUSEL6_3    PWR_WUCR3_WUSEL6(3)
#define PWR_WUCR3_WUSEL7_SHIFT  (12)
#define PWR_WUCR3_WUSEL7_MASK   (0x3 << PWR_WUCR3_WUSEL7_SHIFT)
#define PWR_WUCR3_WUSEL7(n)     ((n) << PWR_WUCR3_WUSEL7_SHIFT)
#  define PWR_WUCR3_WUSEL7_0    PWR_WUCR3_WUSEL7(0)
#  define PWR_WUCR3_WUSEL7_1    PWR_WUCR3_WUSEL7(1)
#  define PWR_WUCR3_WUSEL7_2    PWR_WUCR3_WUSEL7(2)
#  define PWR_WUCR3_WUSEL7_3    PWR_WUCR3_WUSEL7(3)
#define PWR_WUCR3_WUSEL8_SHIFT  (14)
#define PWR_WUCR3_WUSEL8_MASK   (0x3 << PWR_WUCR3_WUSEL8_SHIFT)
#define PWR_WUCR3_WUSEL8(n)     ((n) << PWR_WUCR3_WUSEL8_SHIFT)
#  define PWR_WUCR3_WUSEL8_0    PWR_WUCR3_WUSEL8(0)
#  define PWR_WUCR3_WUSEL8_1    PWR_WUCR3_WUSEL8(1)
#  define PWR_WUCR3_WUSEL8_2    PWR_WUCR3_WUSEL8(2)
#  define PWR_WUCR3_WUSEL8_3    PWR_WUCR3_WUSEL8(3)

/* PWR backup domain control register */

#define PWR_BDCR_RESET          0x00000000
#define PWR_BDCR_VBE            (1 << 0)
#define PWR_BDCR_VBRS           (1 << 1)
#  define PWR_BDCR_VBRS_5K      (0)
#  define PWR_BDCR_VBRS_1K5     PWR_BDCR_VBRS

/* PWR disable backup domain register */

#define PWR_DBPR_RESET          0x00000000
#define PWR_DBPR_DBP            (1 << 0)

/* PWR security configuration register */

#define PWR_SECCFGR_RESET       0x00000000
#define PWR_SECCFGR_WUP1SEC     (1 << 0)
#define PWR_SECCFGR_WUP2SEC     (1 << 1)
#define PWR_SECCFGR_WUP3SEC     (1 << 2)
#define PWR_SECCFGR_WUP4SEC     (1 << 3)
#define PWR_SECCFGR_WUP5SEC     (1 << 4)
#define PWR_SECCFGR_WUP6SEC     (1 << 5)
#define PWR_SECCFGR_WUP7SEC     (1 << 6)
#define PWR_SECCFGR_WUP8SEC     (1 << 7)
#define PWR_SECCFGR_WUP9SEC     (1 << 8)
#define PWR_SECCFGR_WUP10SEC    (1 << 9)
#define PWR_SECCFGR_LPMSEC      (1 << 12)
#define PWR_SECCFGR_VDMSEC      (1 << 13)
#define PWR_SECCFGR_VBSEC       (1 << 14)
#define PWR_SECCFGR_APCSEC      (1 << 15)

