apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_pwr.h
/* PWR privilege control register */

#define PWR_PRIVCFGR_RESET      0x00000000
#define PWR_PRIVCFGR_SPRIV      (1 << 0)
#define PWR_PRIVCFGR_NSPRIV     (1 << 1)

/* PWR status register */

#define PWR_SR_RESET            0x00000000
#define PWR_SR_CSSF             (1 << 0)
#define PWR_SR_STOPF            (1 << 1)
#define PWR_SR_SBF              (1 << 2)

/* PWR supply voltage monitoring status register */

#define PWR_SVMSR_RESET         0x00000000
#define PWR_SVMSR_REGS          (1 << 1)
#  define PWR_SVMSR_REGS_LDO    (0)
#  define PWR_SVMSR_REGS_SMPS   PWR_SVMSR_REGS
#define PWR_SVMSR_PVDO          (1 << 4)
#define PWR_SVMSR_VDDUSBRDY     (1 << 24)
#define PWR_SVMSR_VDDIO2RDY     (1 << 25)
#define PWR_SVMSR_VDDA1RDY      (1 << 26)
#define PWR_SVMSR_VDDA2RDY      (1 << 27)

/* PWR wake-up status register */

#define PWR_WUSR_RESET          0x00000000
#define PWR_WUSR_WUF1           (1 << 0)
#define PWR_WUSR_WUF2           (1 << 1)
#define PWR_WUSR_WUF3           (1 << 2)
#define PWR_WUSR_WUF4           (1 << 3)
#define PWR_WUSR_WUF5           (1 << 4)
#define PWR_WUSR_WUF6           (1 << 5)
#define PWR_WUSR_WUF7           (1 << 6)
#define PWR_WUSR_WUF8           (1 << 7)
#define PWR_WUSR_WUF9           (1 << 8)
#define PWR_WUSR_WUF10          (1 << 9)

/* PWR wake-up status clear register */

#define PWR_WUSCR_RESET         0x00000000
#define PWR_WUSCR_CWUF1         (1 << 0)
#define PWR_WUSCR_CWUF2         (1 << 1)
#define PWR_WUSCR_CWUF3         (1 << 2)
#define PWR_WUSCR_CWUF4         (1 << 3)
#define PWR_WUSCR_CWUF5         (1 << 4)
#define PWR_WUSCR_CWUF6         (1 << 5)
#define PWR_WUSCR_CWUF7         (1 << 6)
#define PWR_WUSCR_CWUF8         (1 << 7)
#define PWR_WUSCR_CWUF9         (1 << 8)
#define PWR_WUSCR_CWUF10        (1 << 9)

/* PWR apply pull configuration register */

#define PWR_APCR_RESET          0x00000000
#define PWR_APCR_APC            (1 << 0)

/* PWR port A pull-up control register */

#define PWR_PUCRA_RESET         0x00000000
#define PWR_PUCRA_PU0           (1 << 0)
#define PWR_PUCRA_PU1           (1 << 1)
#define PWR_PUCRA_PU2           (1 << 2)
#define PWR_PUCRA_PU3           (1 << 3)
#define PWR_PUCRA_PU4           (1 << 4)
#define PWR_PUCRA_PU5           (1 << 5)
#define PWR_PUCRA_PU6           (1 << 6)
#define PWR_PUCRA_PU7           (1 << 7)
#define PWR_PUCRA_PU8           (1 << 8)
#define PWR_PUCRA_PU9           (1 << 9)
#define PWR_PUCRA_PU10          (1 << 10)
#define PWR_PUCRA_PU11          (1 << 11)
#define PWR_PUCRA_PU12          (1 << 12)
#define PWR_PUCRA_PU13          (1 << 13)
#define PWR_PUCRA_PU15          (1 << 15)

/* PWR port A pull-down control register */

#define PWR_PDCRA_RESET         0x00000000
#define PWR_PDCRA_PD0           (1 << 0)
#define PWR_PDCRA_PD1           (1 << 1)
#define PWR_PDCRA_PD2           (1 << 2)
#define PWR_PDCRA_PD3           (1 << 3)
#define PWR_PDCRA_PD4           (1 << 4)
#define PWR_PDCRA_PD5           (1 << 5)
#define PWR_PDCRA_PD6           (1 << 6)
#define PWR_PDCRA_PD7           (1 << 7)
#define PWR_PDCRA_PD8           (1 << 8)
#define PWR_PDCRA_PD9           (1 << 9)
#define PWR_PDCRA_PD10          (1 << 10)
#define PWR_PDCRA_PD11          (1 << 11)
#define PWR_PDCRA_PD12          (1 << 12)
#define PWR_PDCRA_PD14          (1 << 14)

/* PWR port B pull-up control register */

#define PWR_PUCRB_RESET         0x00000000
#define PWR_PUCRB_PU0           (1 << 0)
#define PWR_PUCRB_PU1           (1 << 1)
#define PWR_PUCRB_PU2           (1 << 2)
#define PWR_PUCRB_PU3           (1 << 3)
#define PWR_PUCRB_PU4           (1 << 4)
#define PWR_PUCRB_PU5           (1 << 5)
#define PWR_PUCRB_PU6           (1 << 6)
#define PWR_PUCRB_PU7           (1 << 7)
#define PWR_PUCRB_PU8           (1 << 8)
#define PWR_PUCRB_PU9           (1 << 9)
#define PWR_PUCRB_PU10          (1 << 10)
#define PWR_PUCRB_PU11          (1 << 11)
#define PWR_PUCRB_PU12          (1 << 12)
#define PWR_PUCRB_PU13          (1 << 13)
#define PWR_PUCRB_PU14          (1 << 14)
#define PWR_PUCRB_PU15          (1 << 15)

/* PWR port B pull-down control register */

#define PWR_PDCRB_RESET         0x00000000
#define PWR_PDCRB_PD0           (1 << 0)
#define PWR_PDCRB_PD1           (1 << 1)
#define PWR_PDCRB_PD2           (1 << 2)
#define PWR_PDCRB_PD3           (1 << 3)
#define PWR_PDCRB_PD5           (1 << 5)
#define PWR_PDCRB_PD6           (1 << 6)
#define PWR_PDCRB_PD7           (1 << 7)
#define PWR_PDCRB_PD8           (1 << 8)
#define PWR_PDCRB_PD9           (1 << 9)
#define PWR_PDCRB_PD10          (1 << 10)
#define PWR_PDCRB_PD11          (1 << 11)
#define PWR_PDCRB_PD12          (1 << 12)
#define PWR_PDCRB_PD13          (1 << 13)
#define PWR_PDCRB_PD14          (1 << 14)
#define PWR_PDCRB_PD15          (1 << 15)

/* PWR port C pull-up control register */

#define PWR_PUCRC_RESET         0x00000000
#define PWR_PUCRC_PU0           (1 << 0)
#define PWR_PUCRC_PU1           (1 << 1)
#define PWR_PUCRC_PU2           (1 << 2)
#define PWR_PUCRC_PU3           (1 << 3)
#define PWR_PUCRC_PU4           (1 << 4)
#define PWR_PUCRC_PU5           (1 << 5)
#define PWR_PUCRC_PU6           (1 << 6)
#define PWR_PUCRC_PU7           (1 << 7)
#define PWR_PUCRC_PU8           (1 << 8)
#define PWR_PUCRC_PU9           (1 << 9)
#define PWR_PUCRC_PU10          (1 << 10)
#define PWR_PUCRC_PU11          (1 << 11)
#define PWR_PUCRC_PU12          (1 << 12)
#define PWR_PUCRC_PU13          (1 << 13)
#define PWR_PUCRC_PU14          (1 << 14)
#define PWR_PUCRC_PU15          (1 << 15)

/* PWR port C pull-down control register */

#define PWR_PDCRC_RESET         0x00000000
#define PWR_PDCRC_PD0           (1 << 0)
#define PWR_PDCRC_PD1           (1 << 1)
#define PWR_PDCRC_PD2           (1 << 2)
#define PWR_PDCRC_PD3           (1 << 3)
#define PWR_PDCRC_PD4           (1 << 4)
#define PWR_PDCRC_PD5           (1 << 5)
#define PWR_PDCRC_PD6           (1 << 6)
#define PWR_PDCRC_PD7           (1 << 7)
#define PWR_PDCRC_PD8           (1 << 8)
#define PWR_PDCRC_PD9           (1 << 9)
#define PWR_PDCRC_PD10          (1 << 10)
#define PWR_PDCRC_PD11          (1 << 11)
#define PWR_PDCRC_PD12          (1 << 12)
#define PWR_PDCRC_PD13          (1 << 13)
#define PWR_PDCRC_PD14          (1 << 14)
#define PWR_PDCRC_PD15          (1 << 15)

/* PWR port D pull-up control register */

#define PWR_PUCRD_RESET         0x00000000
#define PWR_PUCRD_PU0           (1 << 0)
#define PWR_PUCRD_PU1           (1 << 1)
#define PWR_PUCRD_PU2           (1 << 2)
#define PWR_PUCRD_PU3           (1 << 3)
#define PWR_PUCRD_PU4           (1 << 4)
#define PWR_PUCRD_PU5           (1 << 5)
#define PWR_PUCRD_PU6           (1 << 6)
#define PWR_PUCRD_PU7           (1 << 7)
#define PWR_PUCRD_PU8           (1 << 8)
#define PWR_PUCRD_PU9           (1 << 9)
#define PWR_PUCRD_PU10          (1 << 10)
#define PWR_PUCRD_PU11          (1 << 11)
#define PWR_PUCRD_PU12          (1 << 12)
#define PWR_PUCRD_PU13          (1 << 13)
#define PWR_PUCRD_PU14          (1 << 14)
#define PWR_PUCRD_PU15          (1 << 15)

/* PWR port D pull-down control register */

#define PWR_PDCRD_RESET         0x00000000
#define PWR_PDCRD_PD0           (1 << 0)
#define PWR_PDCRD_PD1           (1 << 1)
#define PWR_PDCRD_PD2           (1 << 2)
#define PWR_PDCRD_PD3           (1 << 3)
#define PWR_PDCRD_PD4           (1 << 4)
#define PWR_PDCRD_PD5           (1 << 5)
#define PWR_PDCRD_PD6           (1 << 6)
#define PWR_PDCRD_PD7           (1 << 7)
#define PWR_PDCRD_PD8           (1 << 8)
#define PWR_PDCRD_PD9           (1 << 9)
#define PWR_PDCRD_PD10          (1 << 10)
#define PWR_PDCRD_PD11          (1 << 11)
#define PWR_PDCRD_PD12          (1 << 12)
#define PWR_PDCRD_PD13          (1 << 13)
#define PWR_PDCRD_PD14          (1 << 14)
#define PWR_PDCRD_PD15          (1 << 15)

/* PWR port E pull-up control register */

#define PWR_PUCRE_RESET         0x00000000
#define PWR_PUCRE_PU0           (1 << 0)
#define PWR_PUCRE_PU1           (1 << 1)
#define PWR_PUCRE_PU2           (1 << 2)
#define PWR_PUCRE_PU3           (1 << 3)
#define PWR_PUCRE_PU4           (1 << 4)
#define PWR_PUCRE_PU5           (1 << 5)
#define PWR_PUCRE_PU6           (1 << 6)
#define PWR_PUCRE_PU7           (1 << 7)
#define PWR_PUCRE_PU8           (1 << 8)
#define PWR_PUCRE_PU9           (1 << 9)
#define PWR_PUCRE_PU10          (1 << 10)
#define PWR_PUCRE_PU11          (1 << 11)
#define PWR_PUCRE_PU12          (1 << 12)
#define PWR_PUCRE_PU13          (1 << 13)
#define PWR_PUCRE_PU14          (1 << 14)
#define PWR_PUCRE_PU15          (1 << 15)

/* PWR port E pull-down control register */

