apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_pwr.h
#define PWR_PDCRE_RESET         0x00000000
#define PWR_PDCRE_PD0           (1 << 0)
#define PWR_PDCRE_PD1           (1 << 1)
#define PWR_PDCRE_PD2           (1 << 2)
#define PWR_PDCRE_PD3           (1 << 3)
#define PWR_PDCRE_PD4           (1 << 4)
#define PWR_PDCRE_PD5           (1 << 5)
#define PWR_PDCRE_PD6           (1 << 6)
#define PWR_PDCRE_PD7           (1 << 7)
#define PWR_PDCRE_PD8           (1 << 8)
#define PWR_PDCRE_PD9           (1 << 9)
#define PWR_PDCRE_PD10          (1 << 10)
#define PWR_PDCRE_PD11          (1 << 11)
#define PWR_PDCRE_PD12          (1 << 12)
#define PWR_PDCRE_PD13          (1 << 13)
#define PWR_PDCRE_PD14          (1 << 14)
#define PWR_PDCRE_PD15          (1 << 15)

/* PWR port F pull-up control register */

#define PWR_PUCRF_RESET         0x00000000
#define PWR_PUCRF_PU0           (1 << 0)
#define PWR_PUCRF_PU1           (1 << 1)
#define PWR_PUCRF_PU2           (1 << 2)
#define PWR_PUCRF_PU3           (1 << 3)
#define PWR_PUCRF_PU4           (1 << 4)
#define PWR_PUCRF_PU5           (1 << 5)
#define PWR_PUCRF_PU6           (1 << 6)
#define PWR_PUCRF_PU7           (1 << 7)
#define PWR_PUCRF_PU8           (1 << 8)
#define PWR_PUCRF_PU9           (1 << 9)
#define PWR_PUCRF_PU10          (1 << 10)
#define PWR_PUCRF_PU11          (1 << 11)
#define PWR_PUCRF_PU12          (1 << 12)
#define PWR_PUCRF_PU13          (1 << 13)
#define PWR_PUCRF_PU14          (1 << 14)
#define PWR_PUCRF_PU15          (1 << 15)

/* PWR port F pull-down control register */

#define PWR_PDCRF_RESET         0x00000000
#define PWR_PDCRF_PD0           (1 << 0)
#define PWR_PDCRF_PD1           (1 << 1)
#define PWR_PDCRF_PD2           (1 << 2)
#define PWR_PDCRF_PD3           (1 << 3)
#define PWR_PDCRF_PD4           (1 << 4)
#define PWR_PDCRF_PD5           (1 << 5)
#define PWR_PDCRF_PD6           (1 << 6)
#define PWR_PDCRF_PD7           (1 << 7)
#define PWR_PDCRF_PD8           (1 << 8)
#define PWR_PDCRF_PD9           (1 << 9)
#define PWR_PDCRF_PD10          (1 << 10)
#define PWR_PDCRF_PD11          (1 << 11)
#define PWR_PDCRF_PD12          (1 << 12)
#define PWR_PDCRF_PD13          (1 << 13)
#define PWR_PDCRF_PD14          (1 << 14)
#define PWR_PDCRF_PD15          (1 << 15)

/* PWR port G pull-up control register */

#define PWR_PUCRG_RESET         0x00000000
#define PWR_PUCRG_PU0           (1 << 0)
#define PWR_PUCRG_PU1           (1 << 1)
#define PWR_PUCRG_PU2           (1 << 2)
#define PWR_PUCRG_PU3           (1 << 3)
#define PWR_PUCRG_PU4           (1 << 4)
#define PWR_PUCRG_PU5           (1 << 5)
#define PWR_PUCRG_PU6           (1 << 6)
#define PWR_PUCRG_PU7           (1 << 7)
#define PWR_PUCRG_PU8           (1 << 8)
#define PWR_PUCRG_PU9           (1 << 9)
#define PWR_PUCRG_PU10          (1 << 10)
#define PWR_PUCRG_PU11          (1 << 11)
#define PWR_PUCRG_PU12          (1 << 12)
#define PWR_PUCRG_PU13          (1 << 13)
#define PWR_PUCRG_PU14          (1 << 14)
#define PWR_PUCRG_PU15          (1 << 15)

/* PWR port G pull-down control register */

#define PWR_PDCRG_RESET         0x00000000
#define PWR_PDCRG_PD0           (1 << 0)
#define PWR_PDCRG_PD1           (1 << 1)
#define PWR_PDCRG_PD2           (1 << 2)
#define PWR_PDCRG_PD3           (1 << 3)
#define PWR_PDCRG_PD4           (1 << 4)
#define PWR_PDCRG_PD5           (1 << 5)
#define PWR_PDCRG_PD6           (1 << 6)
#define PWR_PDCRG_PD7           (1 << 7)
#define PWR_PDCRG_PD8           (1 << 8)
#define PWR_PDCRG_PD9           (1 << 9)
#define PWR_PDCRG_PD10          (1 << 10)
#define PWR_PDCRG_PD11          (1 << 11)
#define PWR_PDCRG_PD12          (1 << 12)
#define PWR_PDCRG_PD13          (1 << 13)
#define PWR_PDCRG_PD14          (1 << 14)
#define PWR_PDCRG_PD15          (1 << 15)

/* PWR port H pull-up control register */

#define PWR_PUCRH_RESET         0x00000000
#define PWR_PUCRH_PU0           (1 << 0)
#define PWR_PUCRH_PU1           (1 << 1)
#define PWR_PUCRH_PU3           (1 << 3)

/* PWR port H pull-down control register */

#define PWR_PDCRH_RESET         0x00000000
#define PWR_PDCRH_PD0           (1 << 0)
#define PWR_PDCRH_PD1           (1 << 1)
#define PWR_PDCRH_PD3           (1 << 3)

/* PWR I3C pull-up control register 1 */

#define PWR_I3CPUCR1_RESET      0x00000000
#define PWR_I3CPUCR1_PA1_I3CPU  (1 << 0)
#define PWR_I3CPUCR1_PA6_I3CPU  (1 << 1)
#define PWR_I3CPUCR1_PA7_I3CPU  (1 << 2)
#define PWR_I3CPUCR1_PB2_I3CPU  (1 << 4)
#define PWR_I3CPUCR1_PB6_I3CPU  (1 << 5)
#define PWR_I3CPUCR1_PB8_I3CPU  (1 << 6)
#define PWR_I3CPUCR1_PB9_I3CPU  (1 << 7)
#define PWR_I3CPUCR1_PB10_I3CPU (1 << 8)
#define PWR_I3CPUCR1_PB12_I3CPU (1 << 9)
#define PWR_I3CPUCR1_PB13_I3CPU (1 << 10)
#define PWR_I3CPUCR1_PB14_I3CPU (1 << 11)
#define PWR_I3CPUCR1_PB7_I3CPU  (1 << 12)

/* PWR I3C pull-up control register 2 */

#define PWR_I3CPUCR2_RESET      0x00000000
#define PWR_I3CPUCR2_PC0_I3CPU  (1 << 0)
#define PWR_I3CPUCR2_PC1_I3CPU  (1 << 1)
#define PWR_I3CPUCR2_PD12_I3CPU (1 << 3)
#define PWR_I3CPUCR2_PD13_I3CPU (1 << 4)
#define PWR_I3CPUCR2_PG7_I3CPU  (1 << 6)
#define PWR_I3CPUCR2_PG8_I3CPU  (1 << 7)
#define PWR_I3CPUCR2_PG13_I3CPU (1 << 8)
#define PWR_I3CPUCR2_PG14_I3CPU (1 << 9)
#define PWR_I3CPUCR2_PH3_I3CPU  (1 << 11)

#endif /* __ARCH_ARM_SRC_STM32U3_HARDWARE_STM32U3XX_PWR_H */
